apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_lcd.c
  first_pixel = CURRENT_LAYER(priv)->framebuffer +
                (area->y * ESP32S3_LCD_STRIDE +
                 area->x * ESP32S3_LCD_DATA_WIDTH);

  size = (area->h - 1) * ESP32S3_LCD_STRIDE +
         area->w       * ESP32S3_LCD_DATA_WIDTH;

  cache_writeback_addr(first_pixel, size);

  return 0;
}
#endif

/****************************************************************************
 * Name: esp32s3_lcd_base_pandisplay
 *
 * Description:
 *   Validate the pan info. The pan info is queued by the framebuffer
 *   subsystem.
 *
 * Input Parameters:
 *   vtable - The framebuffer driver object
 *   pinfo  - the planeinfo object
 *
 * Returned Value:
 *   Zero is returned on success; a negated errno value is returned on any
 *   failure.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_LCD_DOUBLE_BUFFERED
static int esp32s3_lcd_base_pandisplay(struct fb_vtable_s *vtable,
                                       struct fb_planeinfo_s *pinfo)
{
  if (pinfo->yoffset > ESP32S3_LCD_VRES_VIRTUAL - CONFIG_ESP32S3_LCD_VRES)
    {
      gerr("ERROR: pandisplay yoffset out of bounds: %" PRIu32 ". "
           "The maximum is: %d\n",
           pinfo->yoffset,
           ESP32S3_LCD_VRES_VIRTUAL - CONFIG_ESP32S3_LCD_VRES);
      return -EINVAL;
    }

  return 0;
}
#endif

/****************************************************************************
 * Name: lcd_interrupt
 *
 * Description:
 *   Start sending next frame to LCD.
 *
 * Input Parameters:
 *   irq     - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *   arg     - Not used
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int IRAM_ATTR lcd_interrupt(int irq, void *context, void *arg)
{
  uint32_t regval;
  struct esp32s3_lcd_s *priv = &g_lcd_priv;
  uint32_t status = esp32s3_lcd_getreg(LCD_CAM_LC_DMA_INT_ST_REG);
  int paninfo_count;
  union fb_paninfo_u info;
  struct esp32s3_layer_s *layer;

  esp32s3_lcd_putreg(LCD_CAM_LC_DMA_INT_CLR_REG, status);
  if (status & LCD_CAM_LCD_VSYNC_INT_ST_M)
    {
      /* Stop TX */

      regval  = esp32s3_lcd_getreg(LCD_CAM_LCD_USER_REG);
      regval &= ~LCD_CAM_LCD_START_M;
      esp32s3_lcd_putreg(LCD_CAM_LCD_USER_REG, regval);

      regval  = esp32s3_lcd_getreg(LCD_CAM_LCD_USER_REG);
      regval |= LCD_CAM_LCD_UPDATE_REG_M;
      esp32s3_lcd_putreg(LCD_CAM_LCD_USER_REG, regval);

      /* Clear TX fifo */

      regval  = esp32s3_lcd_getreg(LCD_CAM_LCD_MISC_REG);
      regval |= LCD_CAM_LCD_AFIFO_RESET_M;
      esp32s3_lcd_putreg(LCD_CAM_LCD_MISC_REG, regval);

#if ESP32S3_LCD_LAYERS > 1
      priv->cur_layer = (priv->cur_layer + 1) % ESP32S3_LCD_LAYERS;

      esp32s3_dma_load(CURRENT_LAYER(priv)->dmadesc,
                       priv->dma_channel,
                       true);
#endif

#ifdef CONFIG_ESP32S3_LCD_DOUBLE_BUFFERED
      /* Pan the display to a new buffer offset if one was queued */

      paninfo_count = fb_paninfo_count(&g_base_vtable, FB_NO_OVERLAY);
      if (paninfo_count > 1)
        {
          fb_remove_paninfo(&g_base_vtable, FB_NO_OVERLAY);
        }

      if (paninfo_count > 0 &&
          fb_peek_paninfo(&g_base_vtable, &info, FB_NO_OVERLAY) == OK &&
          priv->yoffset != info.planeinfo.yoffset)
        {
          priv->yoffset = info.planeinfo.yoffset;
          layer = CURRENT_LAYER(priv);

          esp32s3_dma_setup(layer->dmadesc,
                            ESP32S3_LCD_DMADESC_NUM,
                            &layer->framebuffer[priv->yoffset *
                                                ESP32S3_LCD_STRIDE],
                            ESP32S3_LCD_FB_SIZE,
                            true,
                            priv->dma_channel);

          /* Leave this paninfo in the panbuffer so the buffer will be full
           * after the user adds another. poll will report unreadyness to
           * write until it's taken by the next cycle here.
           */
        }
#endif

#ifndef CONFIG_FB_UPDATE
      /* Write framebuffer data from D-cache to PSRAM */

      layer = CURRENT_LAYER(priv);

      cache_writeback_addr(&layer->framebuffer[priv->yoffset *
                                               ESP32S3_LCD_STRIDE],
                           ESP32S3_LCD_FB_SIZE);
#endif

#ifdef ESP32S3_LCD_HAVE_BOUNCE
      /* Anchor the ring at the first bounce buffer again.  The read
       * position needs no correction: the framebuffer is a whole number of
       * bounce buffers, so by the time a frame has been sent the buffers
       * already hold the first two pieces of the next one.
       */

      esp32s3_dma_load(priv->bbdesc[0], priv->dma_channel, true);
#endif

      /* Enable DMA TX */

      esp32s3_dma_enable(priv->dma_channel, true);

      /* Update LCD parameters and start TX */

      regval  = esp32s3_lcd_getreg(LCD_CAM_LCD_USER_REG);
      regval |= LCD_CAM_LCD_UPDATE_REG_M;
      esp32s3_lcd_putreg(LCD_CAM_LCD_USER_REG, regval);

      regval  = esp32s3_lcd_getreg(LCD_CAM_LCD_USER_REG);
      regval |= LCD_CAM_LCD_START_M;
      esp32s3_lcd_putreg(LCD_CAM_LCD_USER_REG, regval);
    }

  return 0;
}

#ifdef ESP32S3_LCD_HAVE_BOUNCE
/****************************************************************************
 * Name: esp32s3_lcd_bounce_fill
 *
 * Description:
 *   Copy the next piece of the framebuffer into a bounce buffer that has
 *   just been sent, and step the read position on.  The position wraps at
 *   the end of the framebuffer, which is also the end of a frame because
 *   the framebuffer is a whole number of bounce buffers, so the two stay in
 *   step without anything having to resynchronise them.
 *
 * Input Parameters:
 *   priv - The LCD driver state.
 *   bb   - Which of the two buffers to refill.
 *
 ****************************************************************************/

static void IRAM_ATTR esp32s3_lcd_bounce_fill(struct esp32s3_lcd_s *priv,
                                              int bb)
{
  struct esp32s3_layer_s *layer = CURRENT_LAYER(priv);

  memcpy(g_bounce[bb],
         &layer->framebuffer[priv->yoffset * ESP32S3_LCD_STRIDE +
                             priv->bouncepos],
         ESP32S3_LCD_BB_SIZE);

  priv->bouncepos += ESP32S3_LCD_BB_SIZE;
  if (priv->bouncepos >= ESP32S3_LCD_FB_SIZE)
    {
      priv->bouncepos = 0;
    }
}

/****************************************************************************
 * Name: esp32s3_lcd_dma_interrupt
 *
 * Description:
 *   One bounce buffer has been sent to the panel.  Refill it while the
 *   other one is being sent.
 *
 ****************************************************************************/

static int IRAM_ATTR esp32s3_lcd_dma_interrupt(int irq, void *context,
                                               void *arg)
{
  struct esp32s3_lcd_s *priv = &g_lcd_priv;
  int status = esp32s3_dma_get_interrupt(priv->dma_channel, true);

  if (status <= 0)
    {
      return 0;
    }

  esp32s3_dma_clear_interrupt(priv->dma_channel, true, status);

