apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_lcd.c
  if ((status & GDMA_LL_EVENT_TX_EOF) != 0)
    {
      /* The buffer that finished is the one this transfer started from */

      esp32s3_lcd_bounce_fill(priv, priv->bbeof & 1);
      priv->bbeof++;
    }

  return 0;
}
#endif

/****************************************************************************
 * Name: esp32s3_lcd_dmasetup
 *
 * Description:
 *   Configure the channel DMA
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int esp32s3_lcd_dmasetup(void)
{
  struct esp32s3_lcd_s *priv = &g_lcd_priv;

  priv->dma_channel = esp32s3_dma_request(ESP32S3_DMA_PERIPH_LCDCAM,
                                          10, 1, true);
  if (priv->dma_channel < 0)
    {
      spierr("Failed to allocate GDMA channel\n");
      return ERROR;
    }

  esp32s3_dma_set_ext_memblk(priv->dma_channel,
                             true,
                             ESP32S3_DMA_EXT_MEMBLK_64B);

  for (int i = 0; i < ESP32S3_LCD_LAYERS; i++)
    {
      struct esp32s3_layer_s *layer = &priv->layer[i];

      /* A framebuffer is large: at 800x480 in 16bpp one is 768000 bytes,
       * twice that when double buffered, so it does not come from internal
       * RAM and the allocation is one that can realistically fail.  Say so
       * rather than faulting on the memset that follows.
       */

      layer->framebuffer = memalign(64, ESP32S3_LCD_FB_MEM_SIZE);
      if (layer->framebuffer == NULL)
        {
          lcderr("Failed to allocate %d bytes for framebuffer %d\n",
                 ESP32S3_LCD_FB_MEM_SIZE, i);
          goto errout;
        }

      memset(layer->framebuffer, 0, ESP32S3_LCD_FB_MEM_SIZE);

      esp32s3_dma_setup(layer->dmadesc,
                        ESP32S3_LCD_DMADESC_NUM,
                        layer->framebuffer,
                        ESP32S3_LCD_FB_SIZE,
                        true, priv->dma_channel);
    }

#ifdef ESP32S3_LCD_HAVE_BOUNCE
    {
      struct esp32s3_dmadesc_s *tail;
      int i;

      /* One chain per bounce buffer, each ending in the end of frame mark
       * that raises the interrupt this driver refills on, and the two of
       * them joined into a ring.  The transfer then never finishes, so the
       * controller runs continuously and the panel sees an unbroken stream.
       */

      for (i = 0; i < 2; i++)
        {
          esp32s3_dma_setup(priv->bbdesc[i],
                            ESP32S3_LCD_BB_DESCS,
                            g_bounce[i],
                            ESP32S3_LCD_BB_SIZE,
                            true, priv->dma_channel);
        }

      for (i = 0; i < 2; i++)
        {
          for (tail = priv->bbdesc[i]; tail->next != NULL; tail = tail->next)
            {
            }

          tail->next = priv->bbdesc[i ^ 1];
        }

      /* Prime both buffers with the start of the first frame */

      priv->bouncepos = 0;
      priv->bbeof     = 0;

      esp32s3_lcd_bounce_fill(priv, 0);
      esp32s3_lcd_bounce_fill(priv, 1);
    }
#endif

  return OK;

errout:
  for (int i = 0; i < ESP32S3_LCD_LAYERS; i++)
    {
      struct esp32s3_layer_s *layer = &priv->layer[i];

      if (layer->framebuffer != NULL)
        {
          free(layer->framebuffer);
          layer->framebuffer = NULL;
        }
    }

  esp32s3_dma_release(priv->dma_channel);
  priv->dma_channel = -1;

  return -ENOMEM;
}

/****************************************************************************
 * Name: esp32s3_lcd_gpio_config
 *
 * Description:
 *   Configure GPIO pins for use with the LCD
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32s3_lcd_gpio_config(void)
{
  const struct esp32s3_lcd_config_s *config = &g_lcd_config;

  lcdinfo("Configuring pins\n");

  /* Configure each pin */

  for (int i = 0; i < ESP32S3_LCD_PINS; i++)
    {
      const struct pin_config_s *pins_config = &config->pins_config[i];

      esp_configgpio(pins_config->num, OUTPUT);
      esp_gpio_matrix_out(pins_config->num, pins_config->signal, 0, 0);
    }
}

/****************************************************************************
 * Name: esp32s3_lcd_enableclk
 *
 * Description:
 *   Enable LCD clock
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32s3_lcd_enableclk(void)
{
  uint32_t regval;
  uint32_t clk_a;
  uint32_t clk_b;

#if ESP32S3_LCD_CLK_RES != 0
    uint32_t divisor = max_common_divisor(ESP32S3_LCD_CLK_RES,
                                          CONFIG_ESP32S3_LCD_CLOCK_MHZ);
    clk_b = ESP32S3_LCD_CLK_RES / divisor;
    clk_a = CONFIG_ESP32S3_LCD_CLOCK_MHZ / divisor;

    lcdinfo("divisor= %" PRIu32 "\n", divisor);
#else
    clk_b = clk_a = 0;
#endif

  lcdinfo("PCLK=%d/(%d + %" PRIu32 "/%" PRIu32 ")\n", ESP32S3_LCD_CLK_MHZ,
          ESP32S3_LCD_CLK_N, clk_b, clk_a);

  periph_module_enable(PERIPH_LCD_CAM_MODULE);

  regval = (1 << LCD_CAM_LCD_CLKCNT_N_S) |
           LCD_CAM_CLK_EN_M |
           LCD_CAM_LCD_CLK_EQU_SYSCLK_M |
           (ESP32S3_LCD_CLK_SEL << LCD_CAM_LCD_CLK_SEL_S) |
           (ESP32S3_LCD_CLK_N << LCD_CAM_LCD_CLKM_DIV_NUM_S) |
           (clk_a << LCD_CAM_LCD_CLKM_DIV_A_S) |
           (clk_b << LCD_CAM_LCD_CLKM_DIV_B_S);

#ifdef CONFIG_ESP32S3_LCD_PCLK_ACTIVE_NEG
  /* Drive the pixel clock high for the first half of the cycle, so that the
   * data lines, and DE and the sync signals with them, are stable across the
   * falling edge the panel latches on.
   */

  regval |= LCD_CAM_LCD_CK_OUT_EDGE_M;
#endif

  esp32s3_lcd_putreg(LCD_CAM_LCD_CLOCK_REG, regval);
}

/****************************************************************************
 * Name: esp32s3_lcd_config
 *
 * Description:
 *   Configure LCD controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; A negated errno value on failure.
 *
 ****************************************************************************/

